Repository: KDE/keysmith
Catalog: po/*/keysmith.po
Languages: ar

# @info (<uri> placeholder)
source: Optional account to add, formatted as otpauth:// URI (e.g. from a QR code)
ar: حساب اختياري للإضافة، بتنسيق otpauth://URI (على سبيل المثال من رمز الاستجابة السريعة)

# @title:window
source: Invalid account
ar: حساب غير صالح

# @info:label
source: The account you are trying to add is invalid. You can either quit the app, or continue without adding the account.
ar: الحساب الذي تحاول إضافته غير صالح. يمكنك إما الخروج من التطبيق أو الاستمرار دون إضافة الحساب.

# @info:label
source: The account you are trying to add is invalid. Continue without adding the account.
ar: الحساب الذي تحاول إضافته غير صالح. تابع دون إضافة الحساب.

# Details dialog title: %1 is the name of the account
source: Details of account: %1
ar: تفاصيل الحساب: %1

source: Name:
ar: الاسم:

source: Issuer:
ar: المُصدِر:

source: Mode:
ar: الوضع:

# Mode of 2fa
source: HOTP
ar: كلمة المرور المستندة على التلبيدة HOTP

# Mode of 2fa
source: TOTP
ar: كلمة المرور المستندة على الوقت TOTP

source: Epoch:
ar: الفترة:

source: Time Step:
ar: خطوة الوقت:

source: Offset:
ar: الإزاحة:

source: Token Length:
ar: طول الرمز:

source: Hash:
ar: التلبيدة:

# Confirm dialog title: %1 is the name of the account to remove
source: Removing account: %1
ar: إزالة الحساب: %1

source: <p><ul><li>Account name: %1</li><li>Account issuer: %2</li></ul></p><p>Removing this account from Keysmith will not disable two-factor authentication (2FA). Make sure you can still access your account without using Keysmith before proceeding:</p><ul><li>Make sure you have another 2FA app set up for your account, or:</li><li>Make sure you have recovery codes for your account, or:</li><li>Disable two-factor authentication on your account</li></ul>
ar: 460 / 5,000<p><ul><li>اسم الحساب: %1</li><li>جهة إصدار الحساب: %2</li></ul></p><p>لن يؤدي إزالة هذا الحساب من صانع المفاتيح إلى تعطيل المصادقة الثنائية (2FA). تأكد من أنه لا يزال بإمكانك الوصول إلى حسابك دون استخدام صانع المفاتيح قبل المتابعة:</p><ul><li>تأكد من إعداد تطبيق مصادقة ثنائية آخر لحسابك، أو:</li><li>تأكد من وجود رموز استرداد لحسابك، أو:</li><li>تعطيل المصادقة الثنائية على حسابك</li></ul>

# Button confirming account removal
source: Delete Account
ar: احذف الحساب

# Notification shown in a passive notification
source: Token copied to clipboard!
ar: نُسخ الرمز إلى الحافظة!

# @label:textbox
source: Account name:
ar: اسم الحساب:

# @label:textbox
source: Account issuer:
ar: مُصدِر الحساب:

# @title:window
source: Accounts
ar: الحسابات

# generic error shown when adding or updating an account failed
source: Failed to update accounts
ar: فشل في تحديث الحسابات

# error message shown when loading accounts from storage failed
source: Some accounts failed to load.
ar: فشلت بعض الحسابات في التحميل.

source: No accounts added
ar: لم تضف أي حساب

source: Add Account
ar: أضف حسابًا

# @action:button add new account, shown in toolbar
source: Add
ar: أضف

# @action:button import accounts, shown in toolbar
source: Import
ar: استورد

# @action:button import an account by scanning a QR code, shown in toolbar
source: Scan QR Code
ar: امسح رمز الاستجابة السريعة

# @title:window
source: Add new account
ar: أضف حسابًا جديدًا

# @action:button cancel and dismiss the add account form
source: Cancel
ar: ألغِ

# @action:button Dismiss the error page and quit Keysmith
source: Quit
ar: أنهِ

# @action:button
source: Add
ar: أضف

# @label:chooser
source: Account type:
ar: نوع الحساب:

# @option:radio
source: Time-based OTP
ar: كلمة مرور المستندة على الوقت

# @option:radio
source: Hash-based OTP
ar: كلمة مرور معتمدة على التلبيدة

source: Token secret
ar: الرمز السري:

# @label:textbox
source: Secret key:
ar: المفتاح السري:

# Button to reveal form for configuring additional token details
source: Details
ar: التفاصيل

# @title:group
source: HOTP Details:
ar: تفاصيل كلمة المرور المستندة على التلبيدة HOTP

# @label
source: TOTP Details:
ar: تفاصيل كلمة المرور المستندة على الوقت TOTP

# @action:button Button to dismiss the error page
source: Continue
ar: تابع

# @action:button Dismiss the error page and quit Keysmtih
source: Quit
ar: أنهِ

# Button to show details of a single account
source: Show details
ar: أظهر التّفاصيل

# Button for removal of a single account
source: Delete account
ar: احذف الحساب

# @label:textbox
source: Counter:
ar: العداد:

# @label:spinbox
source: Token length:
ar: طول الرمز:

# @option:check
source: Add checksum digit
ar: أضف رقم المجموع الاختباري

# @option:check
source: Use custom truncation offset
ar: استخدم إزاحة قطع مخصصة

# @label:spinbox
source: Truncation offset:
ar: إزاحة القطع:

# @title:window
source: Import Accounts
ar: استورد حسابات

source: Import format
ar: استورد تنسيق

# @item:inlistbox
source: andOTP Encrypted JSON
ar: andOTP معمى بصيغة JSON

# @item:inlistbox
source: andOTP Plain JSON
ar: andOTP JSON عادي

# @item:inlistbox
source: FreeOTP URIs
ar: معرفات FreeOTP الموحدة

# @label:chooser
source: Backup file:
ar: ملف نسخ احتياطي:

# @info:placeholder
source: No file selected
ar: لم يُحدّد أيّ ملفّ

# @title:window
source: Select file
ar: اختر ملفّا

# @info:placeholder
source: Decryption password
ar: كلمة سر فك التعمية

# @label:textbox
source: Password:
ar: كلمة السر:

# @action:button
source: Import
ar: استورد

source: About Keysmith
ar: عن صانع المفاتيح

# @title
source: Scan a QR code
ar: امسح رمز الاستجابة السريعة

# @action:intoolbar
source: Select Camera
ar: اختر كاميرا

# @title:dialog
source: Select Camera
ar: اختر كاميرا

# @action:button
source: Close
ar: إغلاق

# @title:window
source: Rename account to add
ar: إعادة تسمية الحساب لإضافته

source: Another account with the same name already exists. Please correct the name or issuer for the new account.
ar: وجد حساب آخر بنفس الاسم بالفعل. يرجى تصحيح الاسم أو الجهة المصدرة للحساب الجديد.

# @action:button cancel and dismiss the rename account form
source: Cancel
ar: ألغِ

source: Add
ar: أضف

# @title:window
source: Password
ar: كلمة السّر

source: Failed to set up your password
ar: فشل في إعداد كلمة سرك

source: Choose a password to protect your accounts
ar: اختر كلمة سر لحماية حساباتك

# @label:textbox
source: New Password:
ar: كلمة السرّ الجديدة:

# @label:textbox
source: Verify password:
ar: أكد كلمة السر:

# @action:button
source: Apply
ar: طبّق

# placeholder text if no token is available
source: (refresh)
ar: (حدّث)

# @label:textbox
source: Timer:
ar: المؤقت:

# @label:textbox
source: Starting at:
ar: يبدأ عند:

# @label:chooser
source: Hash algorithm:
ar: خوارزمية التلبيدة:

source: Failed to unlock your accounts
ar: فشل في فك قفل حساباتك

source: Please provide the password to unlock your accounts
ar: يرجى تقديم كلمة السر لفتح حساباتك

# @action:button
source: Unlock
ar: فك القفل

# @title
source: Keysmith
ar: صانع المفاتيح

source: generate two-factor authentication (2FA) tokens
ar: إنشاء رموز المصادقة الثنائية (2FA)

source: Keysmith
ar: صانع المفاتيح

source: © 2019 KDE Community
ar: © 2019 مجتمع كِيدِي
